rifenburgh
lbos
dingell
lortie
n.v
us$
enserch
sinyard
yamaichi
washington-based
single-a
guterman
hydro-quebec
memotec
businessland
prudential-bache
beebes
trinova
takeover-stock
bergsma
jayark
noncallable
trustcorp
prebon
steinhardt
agip
dapuzzo
courtaulds
shearson
ft-se
banponce
<eos>
goupil
index-arbitrage
mgm\/ua
hoechst
healthvest
gen-probe
morishita
picop
innopac
morgenzon
enviropact
leaseway
chicago-based
campeau
usx
fujisawa
waertsilae
intelogic
toseland
wcrs
interpublic
a$
krasnoyarsk
iran-contra
eurocom
wedtech
house-passed
house-senate
fromstein
friday-the-13th
boveri
tokyu
atlanta-based
daimler-benz
cities\/abc
batibot
marous
guber-peters
toubro
qintex
shevardnadze
detrex
sidhpur
orkem
tenneco
brown-forman
octel
merabank
mega-issues
chugai
toronto-based
valhi
korotich
dinkins
equitec
vogelstein
garratt
naczelnik
merieux
nekoosa
centrust
darman
merksamer
achenbaum
mosbacher
basir
emhart
minpeco
hoelzer
c$
bank-backed
dallas-based
cilcorp
conasupo
dorrance
junk-holders
lyondell
single-a-1
burmah
gatward
straszheim
mitterrand
mahfouz
banxquote
u.s.-soviet
stoltzman
contel
treasurys
bozell
azoff
p&g
runkel
reupke
stateswest
wohlstetter
metromedia
wyss
fk-506
southam
angeles-based
quotron
zoete
grenfell
h.f.
sverdlovsk
verwoerd
ambrosiano
drabinsky
sohmer
s&ls
bronfman
tokyo-based
pilson
fujis
noxell
skase
bond-equivalent
cboe
colgate-palmolive
daffynition
dalkon
freeport-mcmoran
swapo
ciba-geigy
m$
maxicare
knight-ridder
bebear
allied-signal
dai-ichi
spielvogel
b.a.t
krenz
anacomp
honecker
mengistu
refcorp
ore.
kageyama
cocom
ru-486
discovision
double-a
dataproducts
money-fund
kleinwort
g.m.b
telerate
ratners
southmark
firstsouth
arkla
ncnb
uv-b
cluett
torrijos
remics
saab-scania
parsow
h&r
1\/2-year
bankamerica
ferranti
fitzwater
utsumi
boesel
eidsmo
isler
300-a-share
wachter
demler
rorer
agnos
laband
calif.-based
futures-related
unicorp
at&t
hart-scott-rodino
gelbart
deukmejian
cray-3
times-stock
montedison
s&l
kume
benefit-seeking
warner-lambert
d.t.
yetnikoff
boesky
trecker
asarco
erbamont
l.j.
property\/casualty
engelken
falconbridge
quebecor
gramm-rudman
iafp
190-point
o'kicki
single-a-3
s&p
weisfield
thornburgh
hammack
minimills
rhone-poulenc
vermont-slauson
peladeau
savaiko
seita
trelleborg
gutfreund
cananea
hk$
yeargin
jenrette
wathen
homefed
bankruptcy-law
amdura
miami-based
program-trading
hambrecht
rubicam
single-a-2
gintel
ohbayashi
georgia-pacific
provigo
kangyo
fetal-tissue
gaubert
lesk
noranda
calgary-based
190.58-point
upham
mulford
sandinistas
sisulu
bpca
miniscribe
delmed
equity-purchase
brawer
scowcroft
u.s.s.r.
painewebber
chestman
non-u.s.
